reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
namespace I2CAddr {
    constexpr uint8_t PCA9685  = 0x40;
    constexpr uint8_t TCS34725 = 0x29;
    // Ver la nota larga en firmware-esp32/src/main.cpp junto a esta misma
    // constante: es una única escritura corta mientras el VL53L1X todavía
    // responde en 0x29, el mismo instante en que el TCS34725 delantero
    // también sigue vivo ahí. Riesgo acotado y aceptado a propósito.
    constexpr uint8_t VL53L1X_BOOT_ADDR = 0x29;
    constexpr uint8_t VL53L1X = 0x30;
}

namespace ServoChannel {
    constexpr uint8_t CLAW = 0;   // abre/cierra la pinza
    constexpr uint8_t LIFT = 1;   // sube/baja el gripper (no montado todavía)
}

namespace Pwm {
    constexpr uint32_t MOTOR_FREQ_HZ    = 1000;
    constexpr uint8_t  MOTOR_RESOLUTION = 8;     // duty 0..255

    constexpr uint32_t RGB_FREQ_HZ    = 5000;
    constexpr uint8_t  RGB_RESOLUTION = 8;       // duty 0..255

    constexpr uint32_t SERVO_FREQ_HZ  = 50;
    constexpr uint16_t SERVO_TICK_MIN = 205;   // pulso 1.0 ms ->   0 grados
    constexpr uint16_t SERVO_TICK_MAX = 410;   // pulso 2.0 ms -> 180 grados
}

// Prioridades FreeRTOS (mayor número = mayor prioridad).
namespace TaskPriority {
    constexpr UBaseType_t SUPERVISOR      = 6;
    constexpr UBaseType_t MOTOR_CONTROL   = 5;
    constexpr UBaseType_t MISSION         = 4;  // el cerebro: no debe acumular retraso
    constexpr UBaseType_t GRIPPER_CONTROL = 3;
    constexpr UBaseType_t REFLECTANCE     = 3;
    constexpr UBaseType_t COLOR_SENSOR    = 2;
    constexpr UBaseType_t TOF_SENSOR      = 2;
    constexpr UBaseType_t LED_STATUS      = 1;
}

namespace TaskStack {
    constexpr uint32_t SUPERVISOR      = 3072;
    constexpr uint32_t MISSION         = 4096;  // máquina de estados + logs
    constexpr uint32_t MOTOR_CONTROL   = 3072;
    constexpr uint32_t GRIPPER_CONTROL = 3072;
    constexpr uint32_t REFLECTANCE     = 2560;
    constexpr uint32_t COLOR_SENSOR    = 3584;
    constexpr uint32_t TOF_SENSOR      = 4096;
    constexpr uint32_t LED_STATUS      = 2048;
}

namespace TaskPeriodMs {
    constexpr uint32_t SUPERVISOR    = 200;
    constexpr uint32_t MISSION       = 50;   // 20 Hz, de sobra para decidir
    constexpr uint32_t MOTOR_CONTROL = 20;   // 50 Hz
    constexpr uint32_t GRIPPER       = 50;
    constexpr uint32_t REFLECTANCE   = 20;   // 50 Hz, seguimiento de línea
    constexpr uint32_t COLOR_SENSOR  = 100;  // 10 Hz
    constexpr uint32_t TOF_SENSOR    = 50;   // 20 Hz, igual al periodo de rango
    constexpr uint32_t LED_STATUS    = 100;  // más rápido que antes: hace falta para el destello de 5 Hz
}

// Sin heartbeat por más de este tiempo, el supervisor da la tarea por colgada.
constexpr uint32_t WATCHDOG_TIMEOUT_MS = 1000;

// Si MotorTask pasa este tiempo sin un comando fresco de MissionTask, frena
// por su cuenta. Ya no protege contra "se cayó el enlace con la Raspberry
// Pi" (no existe): protege contra "MissionTask se colgó" — mismo mecanismo,
// mismo valor, otro origen del riesgo.
constexpr uint32_t MISSION_FAILSAFE_TIMEOUT_MS = 500;

enum class TaskId : uint8_t {
    MOTOR_CONTROL = 0,
    GRIPPER_CONTROL,
    COLOR_SENSOR,
    REFLECTANCE,
    LED_STATUS,
    TOF_SENSOR,
    MISSION,
    COUNT   // siempre el último
};

#define DEBUG_LINK Serial   // USB nativo: sin Raspberry Pi, no hace falta reservarlo aparte

// ===========================================================================
//  [2] TIPOS COMPARTIDOS ENTRE TAREAS
// ===========================================================================

enum class TeamColor     : uint8_t { NONE = 0, RED = 1, BLUE = 2 };
enum class MotorMode     : uint8_t { STOP = 0, DRIVE = 1 };
enum class GripperAction : uint8_t { OPEN = 0, CLOSE_LLAVE = 1, CLOSE_BANDERA = 2, RAISE = 3, LOWER = 4 };
enum class ColorLabel    : uint8_t { UNKNOWN = 0, BLACK, YELLOW, RED, BLUE, FLOOR };

struct MotorCommand {
    MotorMode mode = MotorMode::STOP;
    int8_t    left  = 0;   // -100..100 (%), lado izquierdo (FL+RL)
    int8_t    right = 0;   // -100..100 (%), lado derecho  (FR+RR)
};

struct GripperCommand {
    GripperAction action = GripperAction::OPEN;
};

// A diferencia de firmware-esp32/, aquí LedCommand también carga la zona de
// piso detectada: MissionTask ya tiene esa lectura a mano (la necesita para
// decidir), así que se la pasa a LedTask en vez de que LedTask vuelva a
// suscribirse a colorQueue por su cuenta — una sola tarea consume cada cola.
struct LedCommand {
    TeamColor  team    = TeamColor::NONE;
    ColorLabel zone     = ColorLabel::UNKNOWN;
    bool       signal  = false;   // "creo ver la bandera" / "la llevo agarrada"
};

struct ColorReading {
    uint32_t   timestamp_ms = 0;
    ColorLabel front        = ColorLabel::UNKNOWN;
    ColorLabel back         = ColorLabel::UNKNOWN;
    bool       front_valid  = false;
    bool       back_valid   = false;
};

struct ReflectanceReading {
    uint32_t timestamp_ms  = 0;
    uint16_t left_raw      = 0;
    uint16_t right_raw     = 0;
    bool     left_on_line  = false;
    bool     right_on_line = false;
};

struct TofReading {
    uint32_t timestamp_ms = 0;
    uint16_t distance_mm  = 0;
    bool     valid        = false;
};

struct HealthReport {
    uint32_t timestamp_ms          = 0;
    uint8_t  faulted_tasks_bitmask = 0;
};

// ===========================================================================
//  [3] COLAS
// ===========================================================================
//
//   MissionTask --> motorCmdQueue   (1, overwrite) --> MotorTask
//               --> gripperCmdQueue (4, FIFO)      --> GripperTask
//               --> ledCmdQueue     (1, overwrite) --> LedTask
//
//   ColorSensorTask --> colorQueue   (4, FIFO)      --> MissionTask
//   ReflectanceTask --> reflectQueue (4, FIFO)      --> MissionTask
//   TofSensorTask   --> tofQueue     (4, FIFO)      --> MissionTask
//   SupervisorTask  --> healthQueue  (1, overwrite) --> MissionTask (solo log)
//
//  Mismo criterio que en firmware-esp32/: colas "overwrite" para datos donde
//  solo importa el valor más reciente, FIFO para eventos que hay que ver
//  todos y en orden. Ninguna tarea usa portMAX_DELAY: todo timeout 0.

