reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    // Color de fondo del LED: la ZONA de piso manda si es una reconocible
    // (amarilla/roja/azul); si el piso es neutro (FLOOR), desconocido o el
    // borde negro, se cae de vuelta al color de EQUIPO — así el LED nunca
    // se apaga sin razón y sigue cumpliendo la identificación que exige el
    // reglamento aun fuera de una zona marcada.
    void ApplyZoneOrTeam(TeamColor team, ColorLabel zone) {
        switch (zone) {
            case ColorLabel::YELLOW: SetRaw(255, 170, 0);  break;
            case ColorLabel::RED:    SetRaw(255, 0, 0);    break;
            case ColorLabel::BLUE:   SetRaw(0, 0, 255);    break;
            case ColorLabel::BLACK:
            case ColorLabel::FLOOR:
            case ColorLabel::UNKNOWN:
            default:
                ApplyTeam(team);
                break;
        }
    }
}

// Cuántas vueltas de LedTask dura cada mitad del destello (encendido/
// apagado) mientras se señaliza la bandera. A TaskPeriodMs::LED_STATUS
// (100 ms) esto da un destello de 5 Hz: notorio sin parecer un LED fundido.
constexpr uint32_t kFlagBlinkHalfPeriodTicks = 1;

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);

    TeamColor  team = TeamColor::NONE;
    ColorLabel zone = ColorLabel::UNKNOWN;
    bool       signal = false;
    uint32_t   blink_tick = 0;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) {
            team = cmd.team;
            zone = cmd.zone;
            signal = cmd.signal;
        }

        if (signal) {
            blink_tick = (blink_tick + 1) % (2 * kFlagBlinkHalfPeriodTicks);
            if (blink_tick < kFlagBlinkHalfPeriodTicks) {
                RgbLed::SetRaw(255, 255, 255);   // destello blanco, superpuesto
            } else {
                RgbLed::ApplyZoneOrTeam(team, zone);
            }
        } else {
            blink_tick = 0;
            RgbLed::ApplyZoneOrTeam(team, zone);
        }

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo (tareas de hardware)

// ===========================================================================
//  [9] MISSIONTASK — el cerebro, sin Raspberry Pi
// ===========================================================================
//
//  Puerto directo de la lógica de raspberry-pi/src/athena/decision.py a
//  C++, adaptado a que aquí NO hay percepción visual de la bandera: donde
//  decision.py usaba ``perception.best(bandera_objetivo)`` (una detección
//  de la cámara con clase, ángulo y distancia), esta versión usa el
//  VL53L1X como sustituto ciego — ver el aviso grande al principio del
//  archivo. Las prioridades y el orden de fases son EXACTAMENTE los mismos
//  que allá, por la misma razón: salirse de la pista y adelantar la
//  secuencia pierden la ronda de inmediato, así que esas dos reglas no
//  pueden depender de que nada más ande bien.

namespace Mission {

// Velocidades y umbrales — mismo rol que ControlConfig en decision.py,
// pero constexpr porque aquí no hay archivo de configuración que cargar.
constexpr int kVelocidadCrucero     = 45;   // % de PWM al avanzar recto
constexpr int kVelocidadBusqueda    = 35;   // % al girar buscando
constexpr int kVelocidadAproximacion = 30;  // % al acercarse / evadir

constexpr uint16_t kDistanciaSenalMm  = 400;  // debajo de esto: "creo verla" (LED)
constexpr uint16_t kDistanciaAgarreMm = 150;  // debajo de esto: cerrar la pinza
constexpr uint8_t  kTofDebounceHits   = 3;    // lecturas seguidas antes de agarrar

constexpr uint32_t kStartupDelayMs   = 3000;  // tiempo para cargar la llave y ubicar el robot
constexpr uint32_t kGripperSettleMs  = 400;   // tiempo mecánico para que el servo llegue
constexpr uint32_t kSpinBurstMs      = 900;   // barrido: cuánto gira sobre su eje
constexpr uint32_t kForwardBurstMs   = 700;   // barrido: cuánto avanza entre giros
constexpr uint32_t kReturnTurnMs     = 1500;  // giro aproximado de 180°, A CALIBRAR EN BANCO

enum class Phase : uint8_t {
    ARRANQUE = 0,
    ASEGURAR_LLAVE,
    BUSCAR_ZONA_NEUTRA,
    DEPOSITAR_LLAVE,
    BUSCAR_BANDERA,
    AGARRAR_BANDERA,
    RETORNAR_GIRANDO,
    RETORNAR_AVANZANDO,
    ENTREGAR,
    TERMINADO,
};

inline ColorLabel ZonaPropia(TeamColor team) {
    return (team == TeamColor::RED) ? ColorLabel::RED : ColorLabel::BLUE;
}

} // namespace Mission

// Evita depender de que el compilador trate a MotorCommand como agregado
// con inicializadores por defecto (necesita C++14+); igual que hace
// firmware-esp32/src/main.cpp, se asigna campo a campo.
inline void SetDrive(MotorCommand &m, int left, int right) {
    m.mode  = MotorMode::DRIVE;
    m.left  = (int8_t)constrain(left, -100, 100);
    m.right = (int8_t)constrain(right, -100, 100);
}

void MissionTask(void *pvTeam) {
    const TeamColor team = *reinterpret_cast<TeamColor *>(pvTeam);

    Mission::Phase phase = Mission::Phase::ARRANQUE;
    Mission::Phase last_logged_phase = phase;
    uint32_t phase_started_ms = millis();

    // Estado propio del barrido de búsqueda (fase BUSCAR_BANDERA).
    bool     buscando_gira = true;
    int8_t   sentido = 1;
    uint8_t  tof_hits = 0;

    ColorReading       last_color{};
    ReflectanceReading last_reflect{};
    TofReading         last_tof{};

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MISSION);
    TickType_t last_wake = xTaskGetTickCount();

    DEBUG_LINK.printf("[Mission] equipo = %s\n", team == TeamColor::RED ? "ROJO" : "AZUL");

    for (;;) {
        // --- 0. Refrescar la última lectura de cada sensor -----------------
        // Igual que hacía run_rover.py: se drena toda la cola y solo importa
        // el dato más reciente de cada tipo.
        ColorReading c;
        while (xQueueReceive(g_colorQueue, &c, 0) == pdTRUE) last_color = c;
        ReflectanceReading r;
        while (xQueueReceive(g_reflectQueue, &r, 0) == pdTRUE) last_reflect = r;
        TofReading t;
        while (xQueueReceive(g_tofQueue, &t, 0) == pdTRUE) last_tof = t;
        HealthReport h;
        while (xQueueReceive(g_healthQueue, &h, 0) == pdTRUE) {
            DEBUG_LINK.printf("[Mission] tareas colgadas, bitmask=0x%02X\n", h.faulted_tasks_bitmask);
        }

        MotorCommand motor;               // por defecto: STOP
        GripperCommand gripper;
        bool send_gripper = false;
        bool senal_bandera = false;       // para el LED de esta vuelta

        // --- 1. PRIORIDAD MÁXIMA: no salirse de la pista -------------------
        // Idéntico a decision.py::_evadir_borde: pisa cualquier otra fase.
        bool evadiendo = false;
        if (last_reflect.left_on_line && last_reflect.right_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
            evadiendo = true;
        } else if (last_reflect.left_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion / 3);
            evadiendo = true;
        } else if (last_reflect.right_on_line) {
            SetDrive(motor, -Mission::kVelocidadAproximacion / 3, -Mission::kVelocidadAproximacion);
            evadiendo = true;
        }

