reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
                // -- 10. Misión completa: quieto -----------------------------
                case Mission::Phase::TERMINADO:
                default:
                    break;
            }
        }

        xQueueOverwrite(g_motorCmdQueue, &motor);
        if (send_gripper) xQueueSend(g_gripperCmdQueue, &gripper, 0);

        LedCommand led;
        led.team = team;
        led.zone = last_color.front_valid ? last_color.front : ColorLabel::UNKNOWN;
        led.signal = senal_bandera;
        xQueueOverwrite(g_ledCmdQueue, &led);

        Heartbeat(TaskId::MISSION);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ===========================================================================
//  [10] SUPERVISORTASK, setup() / loop()
// ===========================================================================

namespace {

void SupervisorTask(void *) {
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SUPERVISOR);
    TickType_t last_wake = xTaskGetTickCount();

    uint8_t previous_faults = 0;

    for (;;) {
        const uint8_t faulted = WatchdogCheck();

        if (faulted != 0) {
            HealthReport report;
            report.timestamp_ms = millis();
            report.faulted_tasks_bitmask = faulted;
            xQueueOverwrite(g_healthQueue, &report);
        }

        if (faulted != previous_faults) {
            DEBUG_LINK.printf("[Supervisor] tareas colgadas: 0x%02X\n", faulted);
            previous_faults = faulted;
        }

        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo

static bool CreateQueues() {
    g_motorCmdQueue   = xQueueCreate(1, sizeof(MotorCommand));
    g_gripperCmdQueue = xQueueCreate(4, sizeof(GripperCommand));
    g_ledCmdQueue     = xQueueCreate(1, sizeof(LedCommand));
    g_colorQueue      = xQueueCreate(4, sizeof(ColorReading));
    g_reflectQueue    = xQueueCreate(4, sizeof(ReflectanceReading));
    g_tofQueue        = xQueueCreate(4, sizeof(TofReading));
    g_healthQueue     = xQueueCreate(1, sizeof(HealthReport));

    return g_motorCmdQueue && g_gripperCmdQueue && g_ledCmdQueue &&
           g_colorQueue && g_reflectQueue && g_tofQueue && g_healthQueue;
}

constexpr uint32_t SERIAL_BAUD_RATE = 115200;

// Vive fuera de setup() porque MissionTask la recibe por puntero al crear
// la tarea (xTaskCreatePinnedToCore no admite pasar un TeamColor por valor
// directamente): tiene que sobrevivir a setup() retornando.
static TeamColor g_myTeam = TeamColor::BLUE;   // sobrescrito abajo por TEAM_SELECT

void setup() {
    DEBUG_LINK.begin(SERIAL_BAUD_RATE);
    delay(200);
    DEBUG_LINK.println("\nAthena Rover 2026 - firmware ESP32-S3 AUTONOMO (sin Raspberry Pi)");

    // -- Selector de equipo: puente físico a GND en Pins::TEAM_SELECT -------
    // Se lee UNA sola vez aquí, antes de crear ninguna tarea: MissionTask
    // recibe el resultado por puntero y no vuelve a tocar este pin.
    pinMode(Pins::TEAM_SELECT, INPUT_PULLUP);
    delay(5);   // deja asentar la lectura tras habilitar el pull-up
    g_myTeam = (digitalRead(Pins::TEAM_SELECT) == LOW) ? TeamColor::RED : TeamColor::BLUE;
    DEBUG_LINK.printf("[Setup] TEAM_SELECT=%d -> equipo %s\n",
                       digitalRead(Pins::TEAM_SELECT),
                       g_myTeam == TeamColor::RED ? "ROJO" : "AZUL");

    // Los dos buses I2C se abren aquí, ANTES de lanzar las tareas, igual que
    // en firmware-esp32/: así ninguna tarea tiene que inicializar hardware
    // compartido por su cuenta.
    Wire.begin(Pins::I2C0_SDA, Pins::I2C0_SCL, 400000);   // PCA9685 + TCS34725 delantero + VL53L1X
    Wire1.begin(Pins::I2C1_SDA, Pins::I2C1_SCL, 400000);  // TCS34725 trasero
    Wire.setTimeOut(25);
    Wire1.setTimeOut(25);

    // VL53L1X en reset desde ya — ver la nota larga en TofSensorTask (y su
    // gemela, más detallada, en firmware-esp32/src/main.cpp) sobre por qué
    // esto tiene que pasar ANTES de crear ninguna tarea.
    pinMode(Pins::TOF_XSHUT, OUTPUT);
    digitalWrite(Pins::TOF_XSHUT, LOW);

    if (!CreateQueues()) {
        DEBUG_LINK.println("[FATAL] no se pudieron crear las colas. Arranque detenido.");
        for (;;) delay(1000);
    }

    // Heartbeats inicializados antes de crear ninguna tarea, para que el
    // supervisor no vea como "recién nacida" a una tarea que ya arrancó.
    WatchdogInit();

    xTaskCreatePinnedToCore(SupervisorTask, "Supervisor", TaskStack::SUPERVISOR,
                            nullptr, TaskPriority::SUPERVISOR, nullptr, 0);
    xTaskCreatePinnedToCore(MissionTask, "Mission", TaskStack::MISSION,
                            &g_myTeam, TaskPriority::MISSION, nullptr, 1);
    xTaskCreatePinnedToCore(MotorTask, "Motors", TaskStack::MOTOR_CONTROL,
                            nullptr, TaskPriority::MOTOR_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(GripperTask, "Gripper", TaskStack::GRIPPER_CONTROL,
                            nullptr, TaskPriority::GRIPPER_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(ColorSensorTask, "ColorSensors", TaskStack::COLOR_SENSOR,
                            nullptr, TaskPriority::COLOR_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(TofSensorTask, "TofSensor", TaskStack::TOF_SENSOR,
                            nullptr, TaskPriority::TOF_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(ReflectanceTask, "Reflectance", TaskStack::REFLECTANCE,
                            nullptr, TaskPriority::REFLECTANCE, nullptr, 0);
    xTaskCreatePinnedToCore(LedTask, "TeamLed", TaskStack::LED_STATUS,
                            nullptr, TaskPriority::LED_STATUS, nullptr, 0);

    DEBUG_LINK.println("Todas las tareas lanzadas. Misión autónoma en marcha.");
}

void loop() {
    // Todo el trabajo ocurre en las tareas. loop() se queda vacío a propósito.
    vTaskDelay(pdMS_TO_TICKS(1000));
}
